%% 两个四元数相乘  
% 
% $$\begin{array}{l}
% {\bf{P}} \circ {\bf{Q}} = ({p_0} + {p_1}{\bf{i}} + {p_2}{\bf{j}} + {p_3}{\bf{k}}) \circ ({q_0} + {q_1}{\bf{i}} + {q_2}{\bf{j}} + {q_3}{\bf{k}})\\
% \begin{array}{*{20}{c}}
% {}&{}
% \end{array}\;\; = ({p_0}{q_0} - {p_1}{q_1} - {p_2}{q_2} - {p_3}{q_3}) + ({p_0}{q_1} + {p_1}{q_0} + {p_2}{q_3} - {p_3}{q_2}){\bf{i}}\\
% \begin{array}{*{20}{c}}
% {}&{}&{}
% \end{array} + ({p_0}{q_2} + {p_2}{q_0} + {p_3}{q_1} - {p_1}{q_3}){\bf{j}} + ({p_0}{q_3} + {p_3}{q_0} + {p_1}{q_2} - {p_2}{q_1}){\bf{k}}
% \end{array}$$
% 

function q = qmul(q1, q2)
% 功能：两个四元数相乘  
% 输入：q1 - 四元数1
%       q2 - 四元数2
% 输出：q - 乘积四元数
    q = [ q1(1) * q2(1) - q1(2) * q2(2) - q1(3) * q2(3) - q1(4) * q2(4);
          q1(1) * q2(2) + q1(2) * q2(1) + q1(3) * q2(4) - q1(4) * q2(3);
          q1(1) * q2(3) + q1(3) * q2(1) + q1(4) * q2(2) - q1(2) * q2(4);
          q1(1) * q2(4) + q1(4) * q2(1) + q1(2) * q2(3) - q1(3) * q2(2) ];
