%% 姿态四元数的等效旋转矢量更新算法

function q = qupdt(q1, rv)
% 功能：姿态四元数的等效旋转矢量更新算法
% 输入：q1 - 输入姿态四元数
%       rv - 等效旋转矢量
% 输出：q - 更新后的姿态四元数
    % q2 = rv2q(rv);        % 先将旋转矢量转换成四元数
    n2 = rv'*rv;
    if n2<1.0e-8  % 1.0e-8
        c = 1-n2*(1/8-n2/384); s = 1/2-n2*(1/48-n2/3840);
    else
        n = sqrt(n2); n_2 = n/2;
        c = cos(n_2); s = sin(n_2)/n;
    end
    q2 = [c; s*rv];         
    % q = qmul(q1, q2);     % 四元数更新算法
    q = [ q1(1) * q2(1) - q1(2) * q2(2) - q1(3) * q2(3) - q1(4) * q2(4);
          q1(1) * q2(2) + q1(2) * q2(1) + q1(3) * q2(4) - q1(4) * q2(3);
          q1(1) * q2(3) + q1(3) * q2(1) + q1(4) * q2(2) - q1(2) * q2(4);
          q1(1) * q2(4) + q1(4) * q2(1) + q1(2) * q2(3) - q1(3) * q2(2) ];
    % normalization
    nq2 = q'*q;
    if (nq2>1.000001 || nq2<0.999999)
        q = q/sqrt(nq2);
    end

